Revit 2026 API

# VerticalAlignmentStyle Enumeration

---

Declares the vertical alignment style of font.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum VerticalAlignmentStyle
```
```vb
Public Enumeration VerticalAlignmentStyle
```
```cpp
public enum class VerticalAlignmentStyle
```
```fsharp
type VerticalAlignmentStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 8 | Alignment to bottom |
| Middle | 4 | Alignment to middle |
| Top | 0 | Alignment to top |

#### Reference

Autodesk.Revit.DB Namespace